{
  "anxious__meeting__leader": "It's natural to feel anxious before meetings — that's how leaders stretch and grow.",
  "anxious__study__creator": "Even in anxious moments, your drive to learn is fueling your creativity.",
  "anxious__exercise__resilient": "Anxiety can be loud, but movement helps quiet the mind. You're building inner strength.",
  
  "tired__study__expert": "Tired minds still grow sharper when fueled by purpose. Keep going.",
  "tired__meeting__leader": "Fatigue tests leaders most. The fact that you show up means you're becoming one.",
  "tired__creative__creator": "Even when you're drained, the creative spark flickers. Let it burn steady, not fast.",

  "peaceful__study__expert": "A peaceful mind absorbs knowledge like a sponge. Let this calm fuel deep understanding.",
  "peaceful__exercise__resilient": "You’re not rushing — you're flowing. That’s the secret of sustainable strength.",
  "peaceful__creative__creator": "Calmness nurtures original ideas. You’re in the right state to create meaningfully.",

  "hopeful__study__creator": "Hope fuels exploration. Your learning is aligned with becoming someone new.",
  "hopeful__meeting__leader": "You carry hope into this meeting — that’s leadership in itself.",
  "hopeful__creative__joyful": "Let that hope color your creativity. You're shaping something uplifting.",

  "focused__study__expert": "Focused effort is how mastery is built. You're stacking future wins.",
  "focused__creative__creator": "This attention is your creative superpower. Stay in flow.",
  "focused__decision__leader": "Leadership starts with clear decisions. Your focus is an asset today.",

  "excited__meeting__leader": "Your energy is contagious. Bring it into the room — that's influence.",
  "excited__creative__creator": "Excitement is a sign: you're aligned with your purpose. Let it guide you.",
  "excited__exercise__resilient": "You’re not just moving — you’re training joyfully. That builds lasting strength.",

  "bored__study__expert": "Boredom is often a gateway to deeper focus. Push through — insight is on the other side.",
  "bored__meeting__leader": "Not every meeting is thrilling, but showing up with intention still builds leadership.",
  "bored__creative__creator": "Sometimes creativity begins when we lean into boredom and shape it into something new.",

  "*__study__*": "Learning is not always easy — but your effort today will echo into your future.",
  "*__creative__*": "Every small act of creativity is a vote for who you're becoming.",
  "*__meeting__*": "How you show up in meetings reflects how you lead yourself. Be intentional.",
  "*__exercise__*": "Movement reminds you that you're alive and capable. Keep moving.",
  "*__*__leader": "You’re shaping your identity through your actions today. That’s how leadership is built.",
  "*__*__creator": "What you're doing today — even if small — contributes to something original.",
  "*__*__resilient": "Your persistence is your proof. Resilience grows through repetition.",
  "*__*__joyful": "Small moments of care, effort, or play can build into lasting joy.",
  "*__*__expert": "Expertise comes not from perfection, but from consistent effort and reflection.",
  "*__*__balanced": "Balance isn’t passive — it’s a skill you're strengthening every time you listen to yourself."
}
